Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: You need to configure API credentials (:setting:`AZURE_DEVOPS_CREDENTIALS`) in the Weblate settings to make this work. Once configured, you will see a :guilabel:`Azure DevOps` option when selecting :ref:`component-vcs`.
sv: Du mÃ¥ste konfigurera API-autentiseringsuppgifter (:setting:`AZURE_DEVOPS_CREDENTIALS`) i Weblate-instÃ¤llningarna fÃ¶r att detta ska fungera. NÃ¤r du har konfigurerat detta kommer du att se ett :guilabel:`Azure DevOps`-alternativ nÃ¤r du vÃ¤ljer :ref:`component-vcs`.

source: Mercurial is another VCS you can use directly in Weblate.
sv: Mercurial Ã¤r ett annat VCS som du kan anvÃ¤nda direkt i Weblate.

source: It should work with any Mercurial version, but there are sometimes incompatible changes to the command-line interface which breaks Weblate integration.
sv: Det bÃ¶r fungera med alla versioner av Mercurial, men ibland fÃ¶rekommer inkompatibla Ã¤ndringar i kommandoradsgrÃ¤nssnittet som stÃ¶r integrationen med Weblate.

source: Weblate uses `git-svn`_ to interact with `subversion`_ repositories. It is a Perl script that lets subversion be used by a Git client, enabling users to maintain a full clone of the internal repository and commit locally.
sv: Weblate anvÃ¤nder `git-svn`_ fÃ¶r att interagera med `subversion`_-arkiv. Det Ã¤r ett Perl-skript som gÃ¶r det mÃ¶jligt att anvÃ¤nda subversion med en Git-klient, vilket gÃ¶r att anvÃ¤ndare kan underhÃ¥lla en fullstÃ¤ndig klon av det interna arkivet och gÃ¶ra lokala commit.

source: Weblate tries to detect Subversion repository layout automatically - it supports both direct URLs for branch or repositories with standard layout (branches/, tags/ and trunk/). More info about this is to be found in the `git-svn documentation <https://git-scm.com/docs/git-svn#Documentation/git-svn.txt---stdlayout>`_. If your repository does not have a standard layout and you encounter errors, try including the branch name in the repository URL and leaving branch empty.
sv: Weblate fÃ¶rsÃ¶ker automatiskt upptÃ¤cka Subversion-arkivets layout â det stÃ¶der bÃ¥de direkta URL:er fÃ¶r grenar eller arkiv med standardlayout (grenar/, taggar/ och stam/). Mer information om detta finns i `git-svn-dokumentationen <https://git-scm.com/docs/git-svn#Documentation/git-svn.txt---stdlayout>`_. Om ditt arkiv inte har en standardlayout och du stÃ¶ter pÃ¥ fel, fÃ¶rsÃ¶k att inkludera grennamnet i arkivets URL och lÃ¤mna grenen tom.

source: Subversion credentials
sv: Subversion-autentiseringsuppgifter

source: Weblate expects you to have accepted the certificate up-front (and your credentials if needed). It will look to insert them into the :setting:`DATA_DIR` directory. Accept the certificate by using `svn` once with the `$HOME` environment variable set to the :setting:`DATA_DIR`:
sv: Weblate fÃ¶rvÃ¤ntar sig att du har godkÃ¤nt certifikatet i fÃ¶rvÃ¤g (och dina inloggningsuppgifter om det behÃ¶vs). Det kommer att fÃ¶rsÃ¶ka infoga dem i katalogen :setting:`DATA_DIR`. GodkÃ¤nn certifikatet genom att anvÃ¤nda `svn` en gÃ¥ng med miljÃ¶variabeln `$HOME` instÃ¤lld pÃ¥ :setting:`DATA_DIR`:

source: Local files
sv: Lokala filer

source: Underneath, this uses :ref:`vcs-git`. It requires Git installed and allows you to switch to using Git natively with full history of your translations.
sv: Under ytan anvÃ¤nder detta :ref:`vcs-git`. Det krÃ¤ver att Git Ã¤r installerat och gÃ¶r det mÃ¶jligt fÃ¶r dig att byta till att anvÃ¤nda Git inbyggt med fullstÃ¤ndig historik Ã¶ver dina Ã¶versÃ¤ttningar.

source: Weblate can also operate without a remote VCS. The initial translations are imported by uploading them. Later you can replace individual files by file upload, or add translation strings directly from Weblate (currently available only for monolingual translations).
sv: Weblate kan Ã¤ven fungera utan ett fjÃ¤rrstyrt VCS. De initiala Ã¶versÃ¤ttningarna importeras genom att ladda upp dem. Senare kan du ersÃ¤tta enskilda filer genom att ladda upp dem, eller lÃ¤gga till Ã¶versÃ¤ttningsstrÃ¤ngar direkt frÃ¥n Weblate (fÃ¶r nÃ¤rvarande endast tillgÃ¤ngligt fÃ¶r ensprÃ¥kiga Ã¶versÃ¤ttningar).

source: In the background Weblate creates a Git repository for you and all changes are tracked in. In case you later decide to use a VCS to store the translations, you already have a repository within Weblate can base your integration on.
sv: I bakgrunden skapar Weblate ett Git-arkiv Ã¥t dig och alla Ã¤ndringar spÃ¥ras dÃ¤r. Om du senare bestÃ¤mmer dig fÃ¶r att anvÃ¤nda ett VCS fÃ¶r att lagra Ã¶versÃ¤ttningarna har du redan ett arkiv i Weblate som du kan basera din integration pÃ¥.

source: Weblate Client
sv: Weblate-klient

source: The Weblate Client is shipped separately and includes the Python module. To use the commands below, you need to install :program:`wlc` using pip:
sv: Weblate Client levereras separat och innehÃ¥ller Python-modulen. FÃ¶r att kunna anvÃ¤nda kommandona nedan mÃ¥ste du installera :program:`wlc` med pip:

source: You can also use this :program:`wlc` as a Python module, see :mod:`wlc`.
sv: Du kan ocksÃ¥ anvÃ¤nda detta :program:`wlc` som en Python-modul, se :mod:`wlc`.

source: Docker usage
sv: AnvÃ¤ndning av Docker

source: The Weblate Client is also available as a Docker image.
sv: Weblate Client finns Ã¤ven tillgÃ¤nglig som Docker-bild.

source: The image is published on Docker Hub: https://hub.docker.com/r/weblate/wlc
sv: Bilden Ã¤r publicerad pÃ¥ Docker Hub: https://hub.docker.com/r/weblate/wlc

source: Installing:
sv: Installerar:

source: The Docker container uses Weblate's default settings and connects to the API deployed in localhost. The API URL and API_KEY can be configured through the arguments accepted by Weblate.
sv: Docker-containern anvÃ¤nder Weblates standardinstÃ¤llningar och ansluter till API:et som Ã¤r distribuerat i localhost. API-URL:en och API_KEY kan konfigureras genom de argument som accepteras av Weblate.

source: The command to launch the container uses the following syntax:
sv: Kommandot fÃ¶r att starta containern anvÃ¤nder fÃ¶ljande syntax:

source: You might want to pass your :ref:`wlc-config` to the Docker container, the easiest approach is to add your current directory as :file:`/home/weblate` volume:
sv: Du kanske vill Ã¶verfÃ¶ra din :ref:`wlc-config` till Docker-containern. Det enklaste sÃ¤ttet Ã¤r att lÃ¤gga till din aktuella katalog som :file:`/home/weblate`-volym:

source: Getting started
sv: Kom igÃ¥ng

source: The :program:`wlc` configuration is stored in :file:`~/.config/weblate` (see :ref:`wlc-config` for other locations), please create it to match your environment:
sv: Konfigurationen fÃ¶r :program:`wlc` lagras i :file:`~/.config/weblate` (se :ref:`wlc-config` fÃ¶r andra platser). Skapa den sÃ¥ att den passar din miljÃ¶:

source: You can then invoke commands on the default server:
sv: Du kan sedan anropa kommandon pÃ¥ standardservern:

source: Legacy configuration
sv: Ãldre konfiguration

source: The legacy configuration using unscoped ``key`` is no longer supported.
sv: Den Ã¤ldre konfigurationen med ospecificerad ``key`` stÃ¶ds inte lÃ¤ngre.

source: Migrate legacy configuration:
sv: Migrera Ã¤ldre konfiguration:

source: To a configuration with key scoped to an API URL:
sv: Till en konfiguration med nyckel som omfattar en API-URL:

source: Synopsis
sv: Sammanfattning

source: Commands actually indicate which operation should be performed.
sv: Kommandon anger faktiskt vilken Ã¥tgÃ¤rd som ska utfÃ¶ras.

source: Weblate Client is a Python library and command-line utility to manage Weblate remotely using :ref:`api`. The command-line utility can be invoked as :command:`wlc` and is built-in on :mod:`wlc`.
sv: Weblate Client Ã¤r ett Python-bibliotek och ett kommandoradsverktyg fÃ¶r att fjÃ¤rrstyra Weblate med hjÃ¤lp av :ref:`api`. Kommandoradsverktyget kan anropas som :command:`wlc` och Ã¤r inbyggt i :mod:`wlc`.

source: Arguments
sv: Argument

source: The program accepts the following arguments which define output format or which Weblate instance to use. These must be entered before any command.
sv: Programmet accepterar fÃ¶ljande argument som definierar utdataformat eller vilken Weblate-instans som ska anvÃ¤ndas. Dessa mÃ¥ste anges fÃ¶re alla kommandon.

source: Specify the output format.
sv: Ange utdataformatet.

source: Specify the API URL. Overrides any value found in the configuration file, see :ref:`wlc-config`. The URL should end with ``/api/``, for example ``https://hosted.weblate.org/api/``.
sv: Ange API-URL. Ã sidosÃ¤tter alla vÃ¤rden som finns i konfigurationsfilen, se :ref:`wlc-config`. URL:en ska sluta med ``/api/``, till exempel ``https://hosted.weblate.org/api/``.

source: Specify the API user key to use. Overrides any value found in the configuration file, see :ref:`wlc-config`. You can find your key in your profile on Weblate.
sv: Ange vilken API-anvÃ¤ndarkod som ska anvÃ¤ndas. Ãverskriver alla vÃ¤rden som finns i konfigurationsfilen, se :ref:`wlc-config`. Du hittar din kod i din profil pÃ¥ Weblate.

source: Overrides the configuration file path, see :ref:`wlc-config`.
sv: Ã sidosÃ¤tter konfigurationsfilens sÃ¶kvÃ¤g, se :ref:`wlc-config`.

source: Overrides configuration file section in use, see :ref:`wlc-config`.
sv: Ã sidosÃ¤tter konfigurationsfilens avsnitt som anvÃ¤nds, se :ref:`wlc-config`.

source: Commands
sv: Kommandon

source: The following commands are available:
sv: FÃ¶ljande kommandon Ã¤r tillgÃ¤ngliga:

source: Prints the current version.
sv: Skriver ut den aktuella versionen.

source: Lists used languages in Weblate.
sv: Listor Ã¶ver sprÃ¥k som anvÃ¤nds i Weblate.

source: Lists projects in Weblate.
sv: Listar projekt i Weblate.

source: Lists components in Weblate.
sv: Listar komponenter i Weblate.

source: Lists translations in Weblate.
sv: Listar Ã¶versÃ¤ttningar i Weblate.

source: Shows Weblate object (translation, component or project).
sv: Visar Weblate-objekt (Ã¶versÃ¤ttning, komponent eller projekt).

source: Lists Weblate object (translation, component or project).
sv: Listar Weblate-objekt (Ã¶versÃ¤ttning, komponent eller projekt).

source: Commits changes made in a Weblate object (translation, component or project).
sv: BekrÃ¤ftar Ã¤ndringar som gjorts i ett Weblate-objekt (Ã¶versÃ¤ttning, komponent eller projekt).

source: Pulls remote repository changes into Weblate object (translation, component or project).
sv: HÃ¤mtar Ã¤ndringar frÃ¥n fjÃ¤rrarkivet till Weblate-objekt (Ã¶versÃ¤ttning, komponent eller projekt).

source: Pushes Weblate object changes into remote repository (translation, component or project).
sv: Skickar Weblate-objektÃ¤ndringar till fjÃ¤rrfÃ¶rvaret (Ã¶versÃ¤ttning, komponent eller projekt).

source: Resets changes in Weblate object to match remote repository (translation, component or project).
sv: Ã terstÃ¤ller Ã¤ndringar i Weblate-objekt sÃ¥ att de matchar det fjÃ¤rranslutna arkivet (Ã¶versÃ¤ttning, komponent eller projekt).

source: Removes any untracked changes in a Weblate object to match the remote repository (translation, component or project).
sv: Tar bort alla ospÃ¥rade Ã¤ndringar i ett Weblate-objekt sÃ¥ att det matchar det fjÃ¤rranslutna arkivet (Ã¶versÃ¤ttning, komponent eller projekt).

source: Displays repository status for a given Weblate object (translation, component or project).
sv: Visar arkivstatus fÃ¶r ett visst Weblate-objekt (Ã¶versÃ¤ttning, komponent eller projekt).

source: Displays detailed statistics for a given Weblate object (translation, component or project).
sv: Visar detaljerad statistik fÃ¶r ett visst Weblate-objekt (Ã¶versÃ¤ttning, komponent eller projekt).

source: Displays lock status.
sv: Visar lÃ¥sstatus.

source: Locks component from further translation in Weblate.
sv: LÃ¥ser komponenten frÃ¥n vidare Ã¶versÃ¤ttning i Weblate.

source: Unlocks translation of Weblate component.
sv: LÃ¥ser upp Ã¶versÃ¤ttning av Weblate-komponenten.

source: Displays changes for a given object.
sv: Visar Ã¤ndringar fÃ¶r ett visst objekt.

source: Downloads a translation file.
sv: HÃ¤mtar en Ã¶versÃ¤ttningsfil.

source: Converts file format, if unspecified no conversion happens on the server and the file is downloaded as is to the repository.
sv: Konverterar filformat. Om inget anges sker ingen konvertering pÃ¥ servern och filen laddas ned till arkivet i befintligt format.

source: Specifies file to save output in, if left unspecified it is printed to stdout.
sv: Anger fil att spara utdata i. Om inget anges skrivs utdata till stdout.

source: Uploads a translation file.
sv: Laddar upp en Ã¶versÃ¤ttningsfil.

source: Overwrite existing translations upon uploading.
sv: Skriv Ã¶ver befintliga Ã¶versÃ¤ttningar vid uppladdning.

source: File from which content is read, if left unspecified it is read from stdin.
sv: Fil frÃ¥n vilken innehÃ¥llet lÃ¤ses. Om inget anges lÃ¤ses det frÃ¥n stdin.

source: Upload method to use, see :ref:`upload-method`.
sv: Uppladdningsmetod att anvÃ¤nda, se :ref:`upload-method`.

source: Author name, to override currently authenticated user
sv: FÃ¶rfattarens namn, fÃ¶r att Ã¥sidosÃ¤tta den fÃ¶r nÃ¤rvarande autentiserade anvÃ¤ndaren

source: Author e-mail, to override currently authenticated user
sv: FÃ¶rfattarens e-postadress, fÃ¶r att Ã¥sidosÃ¤tta den fÃ¶r nÃ¤rvarande autentiserade anvÃ¤ndaren

source: You can get more detailed information on invoking individual commands by passing ``--help``, for example: ``wlc ls --help``.
sv: Du kan fÃ¥ mer detaljerad information om hur du anvÃ¤nder enskilda kommandon genom att ange ``--help``, till exempel: ``wlc ls --help``.

source: Configuration files
sv: Konfigurationsfiler

source: Configuration file placed in the project directory.
sv: Konfigurationsfil placerad i projektkatalogen.

source: User configuration file on Windows in the roamed profile.
sv: AnvÃ¤ndarkonfigurationsfil pÃ¥ Windows i den roamade profilen.

source: User configuration file on Windows in the local profile.
sv: AnvÃ¤ndarkonfigurationsfil pÃ¥ Windows i den lokala profilen.

source: User configuration file.
sv: AnvÃ¤ndarkonfigurationsfil.

source: System wide configuration file.
sv: Systemomfattande konfigurationsfil.

source: The program follows the XDG specification, so you can adjust the placement of config files by environment variables ``XDG_CONFIG_HOME`` or ``XDG_CONFIG_DIRS``.
sv: Programmet fÃ¶ljer XDG-specifikationen, sÃ¥ du kan justera placeringen av konfigurationsfiler med miljÃ¶variablerna ``XDG_CONFIG_HOME`` eller ``XDG_CONFIG_DIRS``.

source: On Windows ``APPDATA`` and ``LOCALAPPDATA`` directories are the preferred locations for the configuration file.
sv: I Windows Ã¤r katalogerna ``APPDATA`` och ``LOCALAPPDATA`` de fÃ¶redragna platserna fÃ¶r konfigurationsfilen.

source: Following settings can be configured in the ``[weblate]`` section (you can customize this by :option:`--config-section`):
sv: FÃ¶ljande instÃ¤llningar kan konfigureras i avsnittet ``[weblate]`` (du kan anpassa detta med :option:`--config-section`):

source: Use the ``[keys]`` section to specify keys scoped for individual API URLs, see :ref:`wlc_legacy`.
sv: AnvÃ¤nd avsnittet ``[keys]`` fÃ¶r att ange nycklar som gÃ¤ller fÃ¶r enskilda API-URL:er, se :ref:`wlc_legacy`.

source: API server URL, defaults to ``http://127.0.0.1:8000/api/``.
sv: API-serverns URL, standardvÃ¤rdet Ã¤r ``http://127.0.0.1:8000/api/``.

source: Path to the default translation - component or project.
sv: SÃ¶kvÃ¤g till standardÃ¶versÃ¤ttningen â komponent eller projekt.

source: The configuration file is an INI file, for example:
sv: Konfigurationsfilen Ã¤r en INI-fil, till exempel:

source: The API keys are stored in the ``[keys]`` section:
sv: API-nycklarna lagras i avsnittet ``[keys]``:

source: This allows you to store keys in your personal settings, while using the :file:`.weblate` configuration in the VCS repository so that :program:`wlc` knows which server it should talk to.
sv: Detta gÃ¶r att du kan lagra nycklar i dina personliga instÃ¤llningar, samtidigt som du anvÃ¤nder :file:`.weblate`-konfigurationen i VCS-arkivet sÃ¥ att :program:`wlc` vet vilken server den ska kommunicera med.

source: Examples
sv: Exempel

source: Print current program version:
sv: Skriv ut aktuell programversion:

source: List all projects:
sv: Lista alla projekt:

source: Upload translation file:
sv: Ladda upp Ã¶versÃ¤ttningsfil:

source: You can also designate what project :program:`wlc` should work on:
sv: Du kan ocksÃ¥ ange vilket projekt :program:`wlc` ska arbeta med:

source: With this setup it is easy to commit pending changes in the current project:
sv: Med denna instÃ¤llning Ã¤r det enkelt att bekrÃ¤fta vÃ¤ntande Ã¤ndringar i det aktuella projektet:

source: Translation workflows
sv: ÃversÃ¤ttningsarbetsflÃ¶den

source: Using Weblate raises quality, reduces manual work, and brings everyone involved in the localization process closer to each other. It is up to you to decide how many of Weblate features you want to make use of.
sv: Att anvÃ¤nda Weblate hÃ¶jer kvaliteten, minskar det manuella arbetet och fÃ¶r alla som Ã¤r involverade i lokaliseringsprocessen nÃ¤rmare varandra. Det Ã¤r upp till dig att bestÃ¤mma hur mÃ¥nga av Weblates funktioner du vill anvÃ¤nda.

source: The following is not a complete list of ways to configure Weblate. You can base other workflows on the examples listed here.
sv: FÃ¶ljande Ã¤r inte en fullstÃ¤ndig lista Ã¶ver sÃ¤tt att konfigurera Weblate. Du kan basera andra arbetsflÃ¶den pÃ¥ exemplen som anges hÃ¤r.

source: In addition to configuration at :ref:`project` and :ref:`component` (as :ref:`project-translation_review`, :ref:`component-enable_suggestions`, :ref:`component-suggestion_voting`, and :ref:`component-suggestion_autoaccept`), the translation workflow can be customized per language.
sv: FÃ¶rutom konfigurationen i :ref:`project` och :ref:`component` (som :ref:`project-translation_review`, :ref:`component-enable_suggestions`, :ref:`component-suggestion_voting` och :ref:`component-suggestion_autoaccept`), kan Ã¶versÃ¤ttningsflÃ¶det anpassas per sprÃ¥k.

source: Site-wide workflow customization can be done while :ref:`changing-languages`.
sv: Anpassning av arbetsflÃ¶det fÃ¶r hela webbplatsen kan gÃ¶ras samtidigt som :ref:`changing-languages`.

source: Per-project customization can be done on each language page of the project.
sv: Anpassning per projekt kan gÃ¶ras pÃ¥ varje sprÃ¥ksida i projektet.

source: All workflow settings can be overridden, the only limitation is that :ref:`project-translation_review` needs to be turned on and can only be disabled in the per-language customization.
sv: Alla arbetsflÃ¶desinstÃ¤llningar kan Ã¥sidosÃ¤ttas, den enda begrÃ¤nsningen Ã¤r att :ref:`project-translation_review` mÃ¥ste vara aktiverat och endast kan inaktiveras i anpassningen per sprÃ¥k.

source: The first existing setting applies:
sv: Den fÃ¶rsta befintliga instÃ¤llningen gÃ¤ller:

source: Project-language customization
sv: Anpassning av projektspråk

source: Language customization
sv: SprÃ¥kanpassning

source: The project/component settings
sv: Projekt-/komponentinstÃ¤llningarna

source: Please be careful when using site-wide override as that applies to all projects (unless they have own overrides for a given language).
sv: Var fÃ¶rsiktig nÃ¤r du anvÃ¤nder webbplatsÃ¶verstyrning, eftersom det gÃ¤ller alla projekt (om de inte har egna Ã¶verstyrningar fÃ¶r ett visst sprÃ¥k).

source: Translation access
sv: ÃversÃ¤ttningsÃ¥tkomst

source: The :ref:`access control <access-control>` is not discussed in detail as a whole in the workflows, as most of its options can be applied to any workflow. Please consult the respective documentation on how to manage access to translations.
sv: :ref:`Ã¥tkomstkontroll <access-control>` behandlas inte i detalj i arbetsflÃ¶dena, eftersom de flesta av dess alternativ kan tillÃ¤mpas pÃ¥ alla arbetsflÃ¶den. Se respektive dokumentation fÃ¶r information om hur du hanterar Ã¥tkomst till Ã¶versÃ¤ttningar.

source: In the following chapters, *any user* means a user who has access to the translation. It can be any authenticated user if the project is public, or a user with :guilabel:`Translate` permission to the project.
sv: I fÃ¶ljande kapitel avses med *alla anvÃ¤ndare* en anvÃ¤ndare som har tillgÃ¥ng till Ã¶versÃ¤ttningen. Det kan vara vilken autentiserad anvÃ¤ndare som helst om projektet Ã¤r offentligt, eller en anvÃ¤ndare med :guilabel:`Translate`-behÃ¶righet fÃ¶r projektet.

source: Each translated string can be in one of the following states:
sv: Varje Ã¶versatt strÃ¤ng kan ha nÃ¥got av fÃ¶ljande tillstÃ¥nd:

source: Translation is empty, it might or not be stored in the file, depending on the file format.
sv: ÃversÃ¤ttningen Ã¤r tom, den kan finnas eller inte finnas i filen, beroende pÃ¥ filformatet.

source: Needs editing / Needs rewriting / Needs checking
sv: BehÃ¶ver redigeras / BehÃ¶ver skrivas om / BehÃ¶ver kontrolleras

source: Translation needs editing, this is usually the result of a source string change, fuzzy matching or translator action. The translation is stored in the file if the :ref:`project-commit_policy` allows it. Depending on the file format it might be marked as needing edit (for example as it gets a ``fuzzy`` flag in the gettext file).
sv: ÃversÃ¤ttningen behÃ¶ver redigeras, vilket vanligtvis beror pÃ¥ en Ã¤ndring i kÃ¤llstrÃ¤ngen, luddig matchning eller en Ã¥tgÃ¤rd frÃ¥n Ã¶versÃ¤ttaren. ÃversÃ¤ttningen sparas i filen om :ref:`project-commit_policy` tillÃ¥ter det. Beroende pÃ¥ filformatet kan den markeras som redigeringsbar (till exempel om den fÃ¥r en ``luddig``-flagga i gettext-filen).

source: Translation is made, but not reviewed. It is stored in the file as a valid translation.
sv: ÃversÃ¤ttningen gÃ¶rs, men granskas inte. Den sparas i filen som en giltig Ã¶versÃ¤ttning.

source: Translation has been approved in the review. It can no longer be changed by translators, but only by reviewers. Translators can only add suggestions to it.
sv: ÃversÃ¤ttningen har godkÃ¤nts i granskningen. Den kan inte lÃ¤ngre Ã¤ndras av Ã¶versÃ¤ttare, utan endast av granskare. ÃversÃ¤ttare kan endast lÃ¤gga till fÃ¶rslag till den.

source: This state is only available when reviews are enabled.
sv: Detta tillstÃ¥nd Ã¤r endast tillgÃ¤ngligt nÃ¤r recensioner Ã¤r aktiverade.

source: String is read-only as a result of having ``read-only`` :ref:`flag <custom-checks>`, being a non-editable source string, or marked such in the translation file.
sv: StrÃ¤ngen Ã¤r skrivskyddad eftersom den har ``read-only`` :ref:`flag <custom-checks>`, Ã¤r en icke-redigerbar kÃ¤llstrÃ¤ng eller Ã¤r markerad som sÃ¥dan i Ã¶versÃ¤ttningsfilen.

source: Suggestions are stored in Weblate only and not in the translation file.
sv: FÃ¶rslagen sparas endast i Weblate och inte i Ã¶versÃ¤ttningsfilen.

source: The states are represented in the translation files when possible.
sv: Staterna representeras i Ã¶versÃ¤ttningsfilerna nÃ¤r det Ã¤r mÃ¶jligt.

source: If the file format you use does not support storing states, you might want to use the :ref:`addon-weblate.flags.same_edit` add-on to flag unchanged strings as needing editing.
sv: Om det filformat du anvÃ¤nder inte stÃ¶der lagring av tillstÃ¥nd kan du anvÃ¤nda tillÃ¤gget :ref:`addon-weblate.flags.same_edit` fÃ¶r att markera ofÃ¶rÃ¤ndrade strÃ¤ngar som behÃ¶ver redigeras.

source: Direct translation
sv: Direkt Ã¶versÃ¤ttning

source: The most common setup for smaller teams, where anybody can translate directly. This is also the default setup in Weblate.
sv: Den vanligaste konfigurationen fÃ¶r mindre team, dÃ¤r alla kan Ã¶versÃ¤tta direkt. Detta Ã¤r ocksÃ¥ standardkonfigurationen i Weblate.

source: *Any user* can edit translations.
sv: *Alla anvÃ¤ndare* kan redigera Ã¶versÃ¤ttningar.

source: Suggestions are optional ways to suggest changes, when translators are not sure about the change.
sv: FÃ¶rslag Ã¤r valfria sÃ¤tt att fÃ¶reslÃ¥ Ã¤ndringar nÃ¤r Ã¶versÃ¤ttarna Ã¤r osÃ¤kra pÃ¥ Ã¤ndringen.

source: Setting
sv: InstÃ¤llning
